XML/Public/PMSQ02/request/body_PMSQ02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
            <![CDATA[
            <MBS>
  <pub>
    <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>txbPMSQ02</SRCBATCHNO>
    <TRANSCODE>PMSQ02</TRANSCODE>
    <TRANSDATETIME>2020-06-10 10:00:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
    <head>
      <ALLAMOUNT>15.00</ALLAMOUNT>
      <ALLCOUNT>1</ALLCOUNT>
    </head>
    <list>
      <detail>
    <SRCSERIALNO>testPMSQ02</SRCSERIALNO>
    <SRCNOTECODE>Z2020061001</SRCNOTECODE>
        <ORGCODE>001004</ORGCODE>
        <APPLYORGCODE>001004</APPLYORGCODE>
        <DEPTCODE></DEPTCODE>
        <PAYDATE>2020-09-04 17:66:77</PAYDATE>
        <PAYTYPECODE>103</PAYTYPECODE>
        <SETTLEMENTMODECODE>101</SETTLEMENTMODECODE>
    <CAPITALCATEGORYCODE></CAPITALCATEGORYCODE>
    <BUDGETITEMCODE></BUDGETITEMCODE>
    <ABSTRACTS></ABSTRACTS>
    <ISURGENT>0</ISURGENT>
    <PURPOSE>商务费用</PURPOSE>
    <CHECKCODE></CHECKCODE>
      <OFFICEPURPOSE></OFFICEPURPOSE>
    <MEMO></MEMO>
        <OURORGCODE>001004</OURORGCODE>
        <OURBANKACCOUNTNUMBER>10000001</OURBANKACCOUNTNUMBER>
        <OURCURCODE>CNY</OURCURCODE>
        <OURAMOUNT>15.00</OURAMOUNT>
        <OPPBANKACCOUNTNAME>韶华</OPPBANKACCOUNTNAME>
        <OPPBANKACCOUNTNUMBER>11</OPPBANKACCOUNTNUMBER>
    <OPPOBJECTNAME>韶华</OPPOBJECTNAME>
    <OPPOBJECTCODE>001004</OPPOBJECTCODE>
    <OPPCOUNTERPARTYCATEGORYCODE></OPPCOUNTERPARTYCATEGORYCODE>
    <OPPBANKCODE></OPPBANKCODE>
    <OPPBANKLOCATIONCODE></OPPBANKLOCATIONCODE>
        <OPPBANKLOCATIONS>甘肃榆中农村合作银行龙泉分理处</OPPBANKLOCATIONS>
    <OPPBANKAREACODE></OPPBANKAREACODE>
        <OPPDIRECTCURCODE>CNY</OPPDIRECTCURCODE>
    <CONTACTS></CONTACTS>
    <OPPCELLPHONE></OPPCELLPHONE>
        <OPPPRIVATEFLAG>1</OPPPRIVATEFLAG>
    <OPPCERTTYPE></OPPCERTTYPE>
    <OPPCERTNUMBER></OPPCERTNUMBER>
    <OPPEMAILADDRESS></OPPEMAILADDRESS>
    <OPPCARDTYPE></OPPCARDTYPE>
        <PROJECTITEMCODE>s01,s02</PROJECTITEMCODE>
        <CONTRACTNUMBER>HT01</CONTRACTNUMBER>
        <voucherentry>
            <voucherentrydetail>
                <VOUCHERENTRYID>1</VOUCHERENTRYID>
                <LENDINGDIRECTION>1</LENDINGDIRECTION>
            <ACCOUNTBALANCE>01</ACCOUNTBALANCE>
            <PAYSRCSERIALNO>Z2020-06-1001</PAYSRCSERIALNO>
            <AUXILIARY_AMOUNT>15</AUXILIARY_AMOUNT>
            <AUXILIARY_CURCODE>CNY</AUXILIARY_CURCODE>
            <VOUCHERENTRY_ABSTRACTS>1111</VOUCHERENTRY_ABSTRACTS>
            <CASHFLOWITEMCODE></CASHFLOWITEMCODE>
            <EXTFIELD1>1</EXTFIELD1>
            <EXTFIELD2>2</EXTFIELD2>
            <EXTFIELD3>3</EXTFIELD3>
            <EXTFIELD4>4</EXTFIELD4>
            <EXTFIELD5>1</EXTFIELD5>
                <auxiliaryentry>
                     <auxiliaryentrydetail>
                     <AUXACCTYPECODE>001</AUXACCTYPECODE>
                     <AUXACCTYPENAME>组织</AUXACCTYPENAME>
                     <AUXACCITEMCODE>011</AUXACCITEMCODE>
                     <AUXACCITEMNAME>011</AUXACCITEMNAME>
                     </auxiliaryentrydetail>
                </auxiliaryentry>
            </voucherentrydetail>
            <voucherentrydetail>
                <VOUCHERENTRYID>2</VOUCHERENTRYID>
                <LENDINGDIRECTION>2</LENDINGDIRECTION>
            <ACCOUNTBALANCE>02</ACCOUNTBALANCE>
            <PAYSRCSERIALNO>Z2020-06-1001</PAYSRCSERIALNO>
            <AUXILIARY_AMOUNT>15</AUXILIARY_AMOUNT>
            <AUXILIARY_CURCODE>CNY</AUXILIARY_CURCODE>
            <VOUCHERENTRY_ABSTRACTS>1111</VOUCHERENTRY_ABSTRACTS>
            <CASHFLOWITEMCODE></CASHFLOWITEMCODE>
            <EXTFIELD1>1</EXTFIELD1>
            <EXTFIELD2>2</EXTFIELD2>
            <EXTFIELD3>3</EXTFIELD3>
            <EXTFIELD4>4</EXTFIELD4>
            <EXTFIELD5>1</EXTFIELD5>
                <auxiliaryentry>
                     <auxiliaryentrydetail>
                     <AUXACCTYPECODE>001</AUXACCTYPECODE>
                     <AUXACCTYPENAME>组织</AUXACCTYPENAME>
                     <AUXACCITEMCODE>011</AUXACCITEMCODE>
                     <AUXACCITEMNAME>011</AUXACCITEMNAME>
                     </auxiliaryentrydetail>
                </auxiliaryentry>
            </voucherentrydetail>
        </voucherentry>
        <budgetentry>
        <budgetentrydetail>
                <BUDGETCODE>cookie2</BUDGETCODE>
                <BUDGETAMOUNT>5</BUDGETAMOUNT>
           <BUDGETMEMO>111</BUDGETMEMO>
        </budgetentrydetail>
         <budgetentrydetail>
                <BUDGETCODE>cookie1</BUDGETCODE>
                <BUDGETAMOUNT>20</BUDGETAMOUNT>
           <BUDGETMEMO>222</BUDGETMEMO>
        </budgetentrydetail>
        </budgetentry>
      </detail>
    </list>
  </req>
</MBS>
            ]]>
         </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>